In [15]:
import pandas as pd
alunosDicionario = {'Nome':['Ricardo', 'Kleber', 'Pedro', 'Carlos'],
         'Nota':[4, 7, 5.5, 9],
         'Aprovado':['Não', 'Sim', 'Não', 'Sim']}

In [16]:
alunosDataFrame= pd.DataFrame(alunosDicionario)

In [17]:
display(alunosDataFrame)

      Nome  Nota Aprovado
0  Ricardo   4.0      Não
1   Kleber   7.0      Sim
2    Pedro   5.5      Não
3   Carlos   9.0      Sim

In [21]:
alunosDataFrame['Nome']

0    Ricardo
1     Kleber
2      Pedro
3     Carlos
Name: Nome, dtype: object

In [23]:
alunosDataFrame['Aprovado']

0    Não
1    Sim
2    Não
3    Sim
Name: Aprovado, dtype: object

In [33]:
alunosDataFrame.loc[[2,3]]

     Nome  Nota Aprovado
2   Pedro   5.5      Não
3  Carlos   9.0      Sim

In [36]:
alunosDataFrame.loc[1:3]

     Nome  Nota Aprovado
1  Kleber   7.0      Sim
2   Pedro   5.5      Não
3  Carlos   9.0      Sim

In [38]:
alunosDataFrame.loc[alunosDataFrame['Nome']=='Carlos']

     Nome  Nota Aprovado
3  Carlos   9.0      Sim

In [41]:
alunosDataFrame.loc[alunosDataFrame['Nota']==5.5]

    Nome  Nota Aprovado
2  Pedro   5.5      Não

In [42]:
alunosDataFrame.loc[alunosDataFrame['Aprovado']=='Sim']

     Nome  Nota Aprovado
1  Kleber   7.0      Sim
3  Carlos   9.0      Sim

In [31]:
freq = alunosDataFrame['Aprovado'].value_counts() 
print(freq)

Não    2
Sim    2
Name: Aprovado, dtype: int64